---
kind: property
id: P:Autodesk.Revit.DB.Mechanical.DuctPressureDropData.Flow
source: html/51942eb2-777f-1a16-5406-bc2320827d21.htm
---
# Autodesk.Revit.DB.Mechanical.DuctPressureDropData.Flow Property

The flow of the duct. Units: (ft³/s).

## Syntax (C#)
```csharp
public double Flow { get; }
```